Repository: DavidBazhenov/PlanB
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: ru

source: you can use api in your projects
ru: вы можете использовать api в своих проектах

source: When creating this API the following were used:<br> python flask, Tesseract, OpenCV
ru: При создании API использовался следующий стек:<br> python flask, Tesseract, OpenCV

source: Structure of <span class="orange">POST</span> requests
ru: Структура <span class="orange">POST</span> запросов

source: In this case, <span class="orangecode">img</span> is an image encoded in base64 format.
ru: В данном случае <span class="orangecode">img</span> - это изображение, закодированное в формате base64.

source: An example of using the <span class="orange">API</span><br> in <span class="orange">Python</span> code
ru: Пример использования <span class="orange">API</span><br> в коде <span class="orange">Python</span>

source: HOME
ru: ГЛАВНАЯ СТРАНИЦА

source: DOCS
ru: ДОКУМЕНТАЦИЯ

source: TRY ONLINE
ru: API ОНЛАЙН

source: File reader
ru: API ФОТО

source: Select file to process
ru: Выберите файл для обработки

source: Click to select file
ru: Нажмите, чтобы выбрать файл

source: Try API
ru: API

source: 1. Introduction:
ru: 1. Введение:

source: &emsp;Text extraction from images is a common task in computer vision and document processing. Tesseract OCR, a powerful open-source OCR engine, provides the foundation for this script. Additionally, image preprocessing steps are incorporated to improve the quality of text recognition.
ru: &emsp;Извлечение текста из изображений является распространенной задачей в компьютерном зрении и обработке документов. Tesseract OCR, мощный механизм распознавания текста с открытым исходным кодом, обеспечивает основу для этого скрипта. Кроме того, изображение для улучшения качества текста включены этапы предварительной обработки распознавание.

source: 2. Image Preprocessing:
ru: 2. Предварительная обработка изображения:

source: <span class="bold">2.1 Grayscale Conversion:</span><br>&emsp;The script begins by converting the input image to grayscale using Opencv cvtColor function. Grayscale images simplify subsequent processing steps.
ru: <span class="bold">2.1 Преобразование оттенков серого:</span><br>&emsp;Сценарий начинается с преобразования входного изображения в оттенки серого с помощью функции Opencv cvtColor. Изображения в оттенках серого упрощают последующие этапы обработки.

source: <span class="bold">2.2 Skew Correction:</span><br>&emsp;Skewness in images can negatively impact OCR accuracy. The getSkewAngle function detects the skew angle and rotate Image corrects it. The process involves thresholding, contour detection, and finding the minimum area rectangle to determine the angle.
ru: <span class="bold">2.2 Исправление перекоса:</span><br>&emsp;Перекос в изображениях может негативно повлиять на точность распознавания. Функция getSkewAngle определяет угол наклона и корректирует его поворотом изображения. Процесс включает в себя установление порогового значения, определение контура и нахождение прямоугольника минимальной площади для определения угла.

source: <span class="bold">2.3 Noise Removal:</span><br><br>&emsp;Noise in images can interfere with OCR. The noise_removal function employs morphological operations to reduce noise, enhancing the clarity of the text.
ru: <span class="bold">2.3 Удаление шума:</span><br><br>&emsp;Шум в изображениях может мешать распознаванию текста. Функция noise_removal использует морфологические операции для уменьшения шума, повышения четкости текста.

source: <span class="bold">2.4 Font Thickening:</span><br><br>&emsp;Thickening the text can improve OCR results, especially for characters with low contrast. The thick_font function utilizes dilation to achieve this effect.
ru: <span class="bold">2.4 Утолщение шрифта:</span><br><br>&emsp;Утолщение текст может улучшить результаты распознавания, особенно для символов с низкой контрастностью. Функция thick_font использует расширение для достижения этого эффекта.

source: 3. Text Extraction using Tesseract OCR:
ru: 3. Извлечение текста с помощью Tesseract OCR:

source: &emsp;The core of the script lies in the img_to_text function, which orchestrates the image preprocessing steps and leverages Tesseract OCR for text extraction.
ru: &emsp;Ядро скрипта лежит в функции img_to_text, которая управляет этапами предварительной обработки изображений и использует Tesseract OCR для извлечения текста

source: 4. Conclusion:
ru: 4. Заключение:

source: &emsp;This script offers a comprehensive solution for text extraction from images. By integrating Tesseract OCR with image preprocessing techniques, it addresses common challenges associated with OCR, making it suitable for a variety of applications, including document digitization and text recognition in images. Users can easily adapt the script for their specific needs, adjusting parameters or combining it with additional image processing methods.
ru: &emsp;Этот скрипт предлагает комплексное решение для извлечения текста из изображений. Интегрируя Tesseract OCR с методами предварительной обработки изображений , он решает общие проблемы, связанные с распознаванием текста, что делает его подходит для различных приложений, включая оцифровку документов и распознавание текста на изображениях. Пользователи могут легко адаптировать скрипт к своим конкретным потребностям, регулируя параметры или комбинируя его с дополнительными методами обработки изображений.

source: Welcome
ru: Добро пожаловать

source: Unlock the power of extracting text from images with our state-of-the-art PhotoToText API. Seamlessly integrate our API into your applications, websites, or services to effortlessly convert text embedded in images into machine-readable data.
ru: Раскройте возможности распознования текста из изображений с помощью нашего API. Вы можете легко интегрировать API в свои приложения, веб-сайты или сервисы, чтобы без особых усилий преобразовать изображения, в текств машиночитаемые данные.

source: Get Started
ru: API

source: Try Online
ru: Приступить
